Revit 2022 API
AnalyticalModelSketchComponent.SetAnalyticalProjectionType Method
 Sets the Analytical Projection to the supplied Analytical Projection Type.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
Since: 2011
Syntax
C#
public void SetAnalyticalProjectionType(
	AnalyticalProjectionType projectionType
)
Visual Basic
Public Sub SetAnalyticalProjectionType ( _
	projectionType As AnalyticalProjectionType _
)
Visual C++
public:
void SetAnalyticalProjectionType(
	AnalyticalProjectionType projectionType
)
Parameters
projectionType
Type: Autodesk.Revit.DB.Structure.AnalyticalProjectionType
 Analytical Projection Type to which the Analytical Model should project.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  projectionType is not valid for this Sketch component.
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
See Also
AnalyticalModelSketchComponent Class
Autodesk.Revit.DB.Structure Namespace